Tekla.Structures.AnalysisInternal.DotAnalysisRigidDiaphragm
The serialization structure for AnalysisRigidDiaphragm.

Tekla.Structures.AnalysisInternal.DotAnalysisRigidDiaphragm._AnalysisObject
The analysis object.

Tekla.Structures.AnalysisInternal.DotAnalysisRigidDiaphragm._ExtremaMinimum
The minimum of the extrema.

Tekla.Structures.AnalysisInternal.DotAnalysisRigidDiaphragm._ExtremaMaximum
The maximum of the extrema.

Tekla.Structures.AnalysisInternal.DotAnalysisRigidDiaphragm._MasterNodeID
The identifier of the master node.

Tekla.Structures.AnalysisInternal.DotAnalysisRigidDiaphragm._NumberOfPartIds
The number of part identifier.

Tekla.Structures.AnalysisInternal.DotAnalysisRigidDiaphragm._PartIds
The part identifier.

Tekla.Structures.AnalysisInternal.DotAnalysisRigidDiaphragm._NumberOfSlaveNodeIds
The number of slave node identifier.

Tekla.Structures.AnalysisInternal.DotAnalysisRigidDiaphragm._SlaveNodeIds
The slave node identifier.

Tekla.Structures.AnalysisInternal.DotAnalysisRigidDiaphragm.ToStruct(Tekla.Structures.Analysis.AnalysisRigidDiaphragm)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisRigidDiaphragm.FromStruct(Tekla.Structures.Analysis.AnalysisRigidDiaphragm)
DO NOT USE! For internal usage only!
P: P.